In [5]:
import pandas as pd
import numpy as np
from numpy import nan as NA

In [2]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])

In [3]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [4]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

### 常用函数

+ dropna

+ fillna

+ isnull

+ notnull

In [15]:
data = pd.Series([1, NA, 3.5, NA, 7])

In [16]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [17]:
data.dropna()    # 删除带有nan的行

0    1.0
2    3.5
4    7.0
dtype: float64

In [18]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                   [NA, NA, NA], [NA, 6.5, 3.]])

In [19]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [22]:
data.dropna(how='all')    # 表示丢弃全部为nan的行， 如果想要丢弃列，只需要传入axis=1就可以了

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [23]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [24]:
data[3] = NA
data

     0    1    2   3
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [26]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [27]:
df = pd.DataFrame(np.random.randn(7, 3))

In [28]:
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA
df

          0         1         2
0  0.252803       NaN       NaN
1  0.455683       NaN       NaN
2  2.339921       NaN -0.111585
3  1.143493       NaN  2.666593
4 -0.834746  2.027456 -1.681904
5  0.805941  0.363652  0.186493
6  0.800265  0.192312  1.242584

In [30]:
df.dropna(thresh=2)    # 大于等于2的NA会被删除

          0         1         2
2  2.339921       NaN -0.111585
3  1.143493       NaN  2.666593
4 -0.834746  2.027456 -1.681904
5  0.805941  0.363652  0.186493
6  0.800265  0.192312  1.242584

### 填充缺失数据

In [31]:
df

          0         1         2
0  0.252803       NaN       NaN
1  0.455683       NaN       NaN
2  2.339921       NaN -0.111585
3  1.143493       NaN  2.666593
4 -0.834746  2.027456 -1.681904
5  0.805941  0.363652  0.186493
6  0.800265  0.192312  1.242584

In [32]:
df.fillna(0)

          0         1         2
0  0.252803  0.000000  0.000000
1  0.455683  0.000000  0.000000
2  2.339921  0.000000 -0.111585
3  1.143493  0.000000  2.666593
4 -0.834746  2.027456 -1.681904
5  0.805941  0.363652  0.186493
6  0.800265  0.192312  1.242584

可以传入一个字典，实现对不同列进行不同值的填充

In [36]:
df.fillna({1: 0.5, 2: 2})
df

          0         1         2
0  0.252803       NaN       NaN
1  0.455683       NaN       NaN
2  2.339921       NaN -0.111585
3  1.143493       NaN  2.666593
4 -0.834746  2.027456 -1.681904
5  0.805941  0.363652  0.186493
6  0.800265  0.192312  1.242584

In [34]:
df

          0         1         2
0  0.252803       NaN       NaN
1  0.455683       NaN       NaN
2  2.339921       NaN -0.111585
3  1.143493       NaN  2.666593
4 -0.834746  2.027456 -1.681904
5  0.805941  0.363652  0.186493
6  0.800265  0.192312  1.242584